In [2]:
import numpy as np
import pandas as pd

In [4]:
#importing csv file
df1 = pd.read_csv("cab_company.csv")
df1

    Uber   6000  100  80  20
0   Lyft  50000   90  50  40
1   Grab  40000   80  60  20
2  Gojek  30000   70  40  30
3    Ola  20000   60  55   5

In [5]:
#the first row is taken as header, to solve this:-

In [6]:
df2 = pd.read_csv("cab_company.csv", header=None)
df2

       0      1    2   3   4
0   Uber   6000  100  80  20
1   Lyft  50000   90  50  40
2   Grab  40000   80  60  20
3  Gojek  30000   70  40  30
4    Ola  20000   60  55   5

In [7]:
#delimiter independent function, we can use custom seperator value in 'read_table'
df3 = pd.read_table("cab_company.csv", sep=',', header=None)
df3

       0      1    2   3   4
0   Uber   6000  100  80  20
1   Lyft  50000   90  50  40
2   Grab  40000   80  60  20
3  Gojek  30000   70  40  30
4    Ola  20000   60  55   5

In [8]:
#importingpartial rows
df4 = pd.read_csv("cab_company.csv", nrows=3, header=None)
df4

      0      1    2   3   4
0  Uber   6000  100  80  20
1  Lyft  50000   90  50  40
2  Grab  40000   80  60  20

In [9]:
df3.to_csv("output_companies1.csv", sep=',')

In [10]:
df3.to_csv("output_companies2.txt", sep='!')

In [11]:
df3.to_csv("output_companies3.txt", columns=[0,1])